// Dept Code Map for Syllabus URL
export const DEPT_CODE_MAP = {
    "文学部": "05",
    "教育学部": "07",
    "教育学研究科": "08",
    "法学部": "15",
    "理学部": "22",
    "工学部": "25",
    "情報融合学環": "26",
    "医学部": "42",
    "薬学部": "44",
    "保健学教育部": "45",
    "自然科学教育部": "51",
    "多言語文化総合教育センター": "54",
    "社会文化科学教育部": "56",
    "教養教育": "58",
    "教養教育（大学院）": "59",
    "医学教育部": "68",
    "薬学教育部": "69",
    "養護教諭特別別科": "72",
    "特別支援教育特別専攻科": "73"
};

// Term Mapping for Normalization
export const TERM_MAP = {
    '前期': ['T1', 'T2'],
    '後期': ['T3', 'T4']
};
